BankAPILibrary/GiniBankAPILibrary/Tests/GiniBankAPILibraryTests/Resources/paymentRequests.json

[
{
  "requesterUri": "ginipay-test://paymentRequester",
  "iban": "DE02300209000106531065",
  "bic": "CMCIDEDDXXX",
  "amount": "335.50:EUR",
  "purpose": "ReNr AZ356789Z",
  "recipient": "Dr. med. Hackler",
  "createdAt": "2021-03-19T09:24:13.028898",
  "status": "paid",
  "_links": {
    "self": "https://pay-api.gini.net/paymentRequests/eacd0efa-e2b8-475b-8888-6264950d0cd5",
    "payment": "https://pay-api.gini.net/paymentRequests/eacd0efa-e2b8-475b-8888-6264950d0cd5/payment"
  }
},
{
  "paymentProvider": "9a9b41f2-32f8-11eb-9fb5-e378350b0392",
  "requesterUri": "ginipay-test://paymentRequester",
  "iban": "DE02300209000106531065",
  "bic": "CMCIDEDDXXX",
  "amount": "335.50:EUR",
  "purpose": "ReNr AZ356789Z",
  "recipient": "Dr. med. Hackler",
  "createdAt": "2021-03-19T09:24:13.028898",
  "status": "paid",
  "_links": {
    "self": "https://pay-api.gini.net/paymentRequests/eacd0efa-e2b8-475b-8888-6264950d0cd5",
    "paymentProvider": "https://pay-api.gini.net/paymentProviders/9a9b41f2-32f8-11eb-9fb5-e378350b0392",
    "payment": "https://pay-api.gini.net/paymentRequests/eacd0efa-e2b8-475b-8888-6264950d0cd5/payment"
  }
}
]
